Submission-of-Assignment-bookers2-app/bookers2.clone/app/controllers/books_controller.rb

  def index
    @book = Book.new
    @books = Book.joins(:user).all
---
SELECT "books".* FROM "books" INNER JOIN "users" ON "users"."id" = "books"."user_id"

  def show
    @book = Book.joins(:user).find(params[:id])
---
SELECT  "books".* FROM "books" INNER JOIN "users" ON "users"."id" = "books"."user_id" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    book = Book.new(book_params)
    book.user_id = current_user.id # joinsを使わなくとも、current_userが活用できる場合はこのような方法も可
    if book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "C"], ["body", "Cさんの投稿"], ["created_at", "2021-04-29 11:05:58.444004"], ["updated_at", "2021-04-29 11:05:58.444004"], ["user_id", 7]]

  def edit
    @book = Book.joins(:user).find(params[:id])
---
SELECT  "books".* FROM "books" INNER JOIN "users" ON "users"."id" = "books"."user_id" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]