Submission-of-Assignment-bookers2-app/bookers2.clone/app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("book_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["book_id", 1], ["created_at", "2021-04-29 09:29:36.336500"], ["updated_at", "2021-04-29 09:29:36.336500"], ["user_id", 1]]
---
  def create
        book = Book.find(params[:book_id])
    favorite = current_user.favorites.new(book_id: book.id)
    favorite.save