Submission-of-Assignment-bookers2-app/bookers2.clone/app/controllers/post_comments_controller.rb

  def create
       book = Book.find(params[:book_id])
    comment = book.post_comments.new(post_comment_params)
    comment.book_id = book.id
    comment.user_id = current_user.id
    comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "book_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "Bさんのコメント"], ["book_id", 1], ["created_at", "2021-04-29 09:33:35.620651"], ["updated_at", "2021-04-29 09:33:35.620651"], ["user_id", 1]]

  def destroy
     PostComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
---
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 3]]
SELECT  "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? AND "post_comments"."book_id" = ? LIMIT ?  [["id", 3], ["book_id", 1], ["LIMIT", 1]]