Submission-of-Assignment-bookers2-app/bookers2.clone/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    if @user.id == current_user.id
      @user_book = Book.where(user_id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "eqfvrbyx5"], ["introduction", "qznka7kxigj1pn85juc"], ["updated_at", "2021-05-11 08:11:37.256025"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def follows
    @title = "Follows"
    @user  = User.find(params[:id])