Submission-of-Assignment-bookers2-app/bookers2.clone/app/views/users/show_follow.html.erb

      <span><%= link_to "view my profile", @user %></span>
      <span><b>Books:</b> <%= @user.books.count %></span>
---
SELECT COUNT(*) FROM "books" WHERE "books"."user_id" = ?  [["user_id", 6]]