Submission-of-Assignment-bookers2-app/bookers2.clone/app/views/books/index.html.erb

           <%= link_to book_favorites_path(f.id), method: :delete do %>
            ♥<%= f.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

           <%= link_to book_favorites_path(f.id), method: :post do %>
            ♡<%= f.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

        </td>
        <td> コメント件数：<%= f.post_comments.count %></td>
---
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]