Submission-of-Assignment-bookers2-app/bookers2.clone/app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
       <%= link_to book_favorites_path(@book.id), method: :delete do %>
        ♥<%= @book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
        <%= link_to book_favorites_path(@book.id), method: :post do %>
        ♡<%= @book.favorites.count %>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 3]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
      <th>
       コメント件数：<%= @book.post_comments.count %>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
    <ul>
      <% @book.post_comments.each do |post_comment| %>